{"Agency-Habit":{"slug":"Agency-Habit","title":"Agency Habit","links":[],"tags":[],"content":"Mental Habit: Action-Orientation and Agency in Engineering Education\n1. Description and Theoretical Framework\nDefinition and Importance\nAction-orientation and agency is a mental habit characterized by a proactive stance toward problem-solving, an internalized locus of control, and the ability to find or create resources to overcome obstacles. This habit involves taking initiative without waiting for directive, seeing oneself as capable of effecting change, and demonstrating resourcefulness when faced with limitations or constraints.\nFor engineers, developing a strong sense of agency is critical because engineering work frequently involves navigating complex, ambiguous challenges with incomplete information and limited resources. As noted by researchers, engineers with an internal locus of control “tend to set more challenging goals, persist in the face of adversity, experience less job stress, and be more successful generally” (Cobb-Clark, 2015). The habit of action-orientation enables engineers to move beyond analysis paralysis and take decisive steps to address problems, even when perfect solutions aren’t immediately apparent.\nTheoretical Framework: The Agency-Resource-Action Model\nThe development of action-orientation and agency can be conceptualized through a three-component model that addresses the psychological, resource-based, and behavioral aspects of this mental habit:\n\n\nAgency Component (Psychological): This involves developing an internal locus of control and self-efficacy:\n\nInternal Locus of Control: The belief that one has significant control over outcomes rather than being at the mercy of external forces or luck\nSelf-Efficacy: Confidence in one’s ability to execute actions necessary to achieve desired outcomes\nGrowth Mindset: The belief that abilities can be developed through dedication and hard work\n\n\n\nResource Component (Strategic): This involves developing the capability to identify, obtain, or create necessary resources:\n\nResource Awareness: Recognizing what resources are available and how they might be leveraged\nResource Acquisition: Skills in obtaining additional resources through networking, collaboration, or persuasion\nResource Creation: The ability to develop new resources or repurpose existing ones in novel ways\n\n\n\nAction Component (Behavioral): This involves translating agency and resources into tangible action:\n\nInitiative: Taking action without being prompted or directed by others\nPersistence: Maintaining effort despite obstacles or setbacks\nAdaptability: Adjusting approach based on feedback and changing conditions\n\n\n\nThis model recognizes that action-orientation and agency in engineering is not merely about positive thinking, but involves a complex interplay between psychological factors, strategic resource management, and behavioral habits that can be systematically developed through engineering education.\n2. Engineering Education Applications\nDetailed Implementation: The “Constrained Resources Engineering Challenge”\nOverview\nThe Constrained Resources Engineering Challenge is a semester-long project-based learning experience designed for second-year mechanical engineering students. The challenge develops action-orientation and agency by requiring students to design and build a functional mechanical system with deliberately limited resources, minimal instruction, and progressively increasing constraints. The experience forces students to develop resourcefulness, take initiative, and build confidence in their ability to overcome challenging limitations.\nTechnical Setup and Materials\nInitial Resources (Phase 1):\n\nBasic mechanical components kit (gears, pulleys, shafts, bearings, etc.)\nStandard set of hand tools\nLimited selection of materials (aluminum, wood, plastics)\nBasic fabrication equipment access (drill press, band saw, basic machine shop)\nTechnical documentation for components\nModest budget ($50 per team)\n\nProgressive Constraint Elements:\n\nResource reduction schedule (components and materials reduced by 25% in Phase 2)\nTime constraints that tighten as project progresses\n“Disruption cards” introducing unexpected limitations\n“Resource scarcity” periods where certain materials become unavailable\nCollaborative restriction phases where teams cannot communicate\n“Market volatility” where resource costs fluctuate unpredictably\n\nAssessment Tools:\n\nEngineering journals documenting decision-making processes\nResource utilization tracking forms\nTeam retrospective templates\nInitiative assessment rubrics\nSelf and peer evaluation forms\nProcess observation protocols for instructors\n\nImplementation Process\nPhase 1: Initial Challenge and Baseline Assessment (3 weeks)\n\n\nStudents form teams of 3-4 members and are presented with the semester challenge: Design and build a mechanical system that can transport a small payload up a variable incline with specified performance metrics.\n\n\nTeams receive their initial resource allocation and modest budget.\n\n\nImportantly, instructors provide minimal procedural guidance, offering only:\n\nTechnical performance requirements\nSafety boundaries\nBasic schedule milestones\nEvaluation criteria\n\n\n\nTeams must develop their own:\n\nDesign process documentation\nTask allocation systems\nDecision-making frameworks\nTesting protocols\n\n\n\nDuring this phase, instructors assess baseline action-orientation traits:\n\nHow quickly teams begin active work versus planning\nWhether teams ask for permission or forgiveness\nWho takes initiative without being assigned roles\nHow teams respond to initial obstacles\n\n\n\nPhase 2: Resource Constraints and Adaptation (4 weeks)\n\n\nOnce initial designs are developed, the instructor introduces the first major constraint:\n\n25% reduction in available materials and components\nIntroduction of “disruption cards” that randomly remove a critical resource\nNo additional budget allocations permitted\n\n\n\nTeams must adapt their designs while maintaining required performance metrics, forcing:\n\nCreative repurposing of existing materials\nDevelopment of alternative approaches\nStrategic decisions about what elements to preserve versus modify\n\n\n\nWeekly team debriefs focus on:\n\nHow constraints affect team dynamics\nIndividual response to frustration\nDevelopment of creative workarounds\nShifts in locus of control perceptions\n\n\n\nInstructors monitor and document:\n\nWhich teams proactively adapt versus requesting exceptions\nHow quickly teams pivot to new approaches\nEvidence of resourcefulness in material usage\nSigns of initiative in finding alternative solutions\n\n\n\nPhase 3: Market and Collaboration Constraints (4 weeks)\n\n\nThe instructor introduces complex systemic constraints:\n\n“Market volatility” creates unpredictable resource pricing\nTemporary “resource shortages” make certain components unavailable\nCommunication blackout periods limit team collaboration time\nRandom “inspection challenges” require immediate demonstration of progress\n\n\n\nTeams must now not only adapt their technical solutions but also:\n\nDevelop contingency plans for resource scarcity\nCreate decentralized decision-making processes\nImplement robust documentation for asynchronous work\nBuild resilience into their designs and processes\n\n\n\nWeekly reflection sessions specifically address:\n\nTeam response to uncertainty and ambiguity\nIndividual comfort with autonomous decision-making\nDevelopment of proactive versus reactive mindsets\nEmerging leadership and initiative patterns\n\n\n\nPhase 4: Final Challenge and Meta-Reflection (3 weeks)\n\n\nFor the final phase, teams face a culminating challenge:\n\n24-hour notice to integrate an entirely new requirement into their design\nReduction of remaining materials budget by 50%\nRequirement to document their process in a format usable by future students\n\n\n\nTeams must deliver:\n\nA functional prototype meeting all performance requirements\nComplete documentation of their engineering process\nAnalysis of resource utilization efficiency\nReflection on their growth in action-orientation and agency\n\n\n\nThe final assessment includes:\n\nTechnical performance of the prototype\nResource efficiency metrics\nProcess documentation quality\nTeam and individual growth in agency metrics\nPeer and self-assessment of action-orientation development\n\n\n\nLearning Outcomes and Habit Development\nThis implementation develops several key engineering competencies:\n\nDesign under constraint: Students learn to create solutions with limited resources\nAdaptive problem-solving: Students develop the ability to pivot when initial approaches fail\nResource optimization: Students learn to maximize the utility of limited materials\nProcess resilience: Students build systems that can withstand unexpected disruptions\n\nMost importantly, the experience systematically cultivates action-orientation and agency by:\n\nCreating an environment where passive approaches consistently fail\nRequiring students to take initiative without clear instructions\nBuilding confidence through progressive mastery experiences\nDeveloping resourcefulness as a normalized response to constraints\nReinforcing an internal locus of control through repeated demonstration of agency\n\nAssessment data from implementations of similar challenges shows that students initially display frustration and seek additional resources or clearer guidance, but gradually develop greater comfort with ambiguity and constraints. By the end of the semester, most teams demonstrate significantly higher levels of initiative, resourcefulness, and confidence in their ability to overcome engineering challenges with limited resources.\n3. Assessment and Measurement\nIndicators of Action-Orientation and Agency as a Mental Habit\nObservable behaviors that indicate action-orientation and agency has become habitual in engineering students include:\n\nInitiating problem-solving without waiting for instruction or permission\nPersisting through obstacles rather than becoming discouraged\nSeeking creative ways to overcome resource limitations\nTaking responsibility for outcomes rather than blaming circumstances\nExpressing confidence in ability to affect change\nDemonstrating comfort with ambiguity and incomplete information\nActively seeking feedback rather than waiting for evaluation\nSetting ambitious goals beyond minimum requirements\nCreating contingency plans for potential obstacles\nOffering solutions rather than just identifying problems\n\nAssessment Methods\n1. Locus of Control Instruments Validated psychological measures like Rotter’s Internal-External Locus of Control Scale can be modified for engineering contexts to assess whether students attribute outcomes to their own actions versus external factors (Cobb-Clark, 2015).\n2. Behavioral Observation Protocols Structured observation of student behaviors during open-ended projects can track specific indicators of initiative, persistence, and resourcefulness as they develop over time (Edutopia, 2015).\n3. Resource Utilization Metrics Tracking how students use available resources and their strategies for overcoming resource limitations provides objective measures of their resourcefulness development (Indeed, 2024).\n4. Decision Analysis Analyzing the decision-making processes documented in engineering journals, with particular attention to how students respond to constraints and setbacks, can reveal growth in action-orientation (Zippia, 2023).\n5. Initiative Mapping Documenting when and how students take action without prompting across multiple projects over time can demonstrate the development of initiative as a habitual response (SkillsCamp, 2024).\n6. Self and Peer Reflection Structured reflection exercises that ask students to assess their own and their peers’ action-orientation provides valuable insight into the development of these habits from multiple perspectives (Arizona State University, n.d.).\n4. Challenges and Considerations\nPotential Barriers\n1. Educational Conditioning Many students have been conditioned through previous educational experiences to wait for instruction, follow prescribed processes, and avoid risk, making the development of action-orientation challenging (Education Hub, 2024).\n2. Fear of Failure Students may be reluctant to take initiative or try creative approaches due to concerns about grades, peer judgment, or damage to their academic standing if they fail (Towards Data Science, 2025).\n3. Structural Constraints Traditional engineering curriculum structures with rigid assignments, clear instructions, and prescribed outcomes may inadvertently reinforce passive learning approaches (Frontiers, 2020).\n4. Assessment Misalignment Traditional assessment methods often evaluate technical knowledge rather than process skills like initiative and resourcefulness, potentially sending mixed messages about what is valued (Science Direct, 2019).\n5. Individual Differences Students begin with different baseline tendencies toward internal or external locus of control based on prior experiences and cultural influences (Wikipedia, 2024).\nMitigation Strategies\n1. Progressive Challenge Design Scaffolding challenges with gradually increasing ambiguity and decreasing guidance helps students build confidence in their autonomous problem-solving capabilities (Bright Hub, 2010).\n2. Explicit Value Signaling Clearly communicating the value of action-orientation and agency in engineering careers and incorporating these traits into formal assessment helps students understand their importance (Leader in Me, 2019).\n3. Failure Reframing Creating a learning environment where failed attempts are valued as learning opportunities rather than mistakes reduces the perceived risk of taking initiative (Matter App, n.d.).\n4. Faculty Development Training faculty to resist the urge to provide too much guidance when students are struggling helps maintain appropriate challenge levels for agency development (Canadian Association of Second Language Teachers, 2021).\n5. Success Story Highlighting Sharing examples of how resourcefulness and action-orientation have led to engineering innovations helps students recognize the value of these traits (SkillsCamp, 2024).\n5. References\nArizona State University. (n.d.). Be Resourceful. CareerWISE. careerwise.asu.edu/apply-problem-solving/learn-problem-solving-skills/be-resourceful\nBright Hub. (2010). Learn Characteristics of a Proactive Leader for Success in Your Leadership Role. www.brighthub.com/office/home/articles/72690/\nCanadian Association of Second Language Teachers. (2021). Action-Oriented Approach. www.caslt.org/en/in-the-classroom/aoa/\nCobb-Clark, D. (2015). Locus of control and the labor market. IZA Journal of Labor Economics. izajole.springeropen.com/articles/10.1186/s40172-014-0017-x\nEducation Hub. (2024). The role of agency in learning. theeducationhub.org.nz/agency/\nEdutopia. (2015). Teaching for Life Success: Why Resourcefulness Matters. www.edutopia.org/blog/8-pathways-why-resourcefulness-matters-marilyn-price-mitchell\nFrontiers. (2020). Agency for Learning: Intention, Motivation, Self-Efficacy and Self-Regulation. www.frontiersin.org/journals/education/articles/10.3389/feduc.2020.00019/full\nIndeed. (2024). Resourcefulness Skills: Definition and Examples. www.indeed.com/career-advice/resumes-cover-letters/resourcefulness-skills\nLeader in Me. (2019). How to Be a Proactive Teacher and Why It Matters. www.leaderinme.org/blog/how-to-be-a-proactive-teacher-and-why-it-matters/\nMatter App. (n.d.). Resourcefulness. 2025 Educational Skill Guide. matterapp.com/skills/resourcefulness\nScience Direct. (2019). Action-orientation in education for sustainable development: Teachers’ interests and instructional practices. www.sciencedirect.com/science/article/abs/pii/S0959652622030505\nSkillsCamp. (2024). Problem-Solving &amp; Resourcefulness Workshops. www.skillscamp.co/resourcefulness-problem-solving/\nStructural Learning. (2024). Locus of Control. www.structural-learning.com/post/locus-of-control\nTowards Data Science. (2025). Be Resourceful - One Of The Most Important Skills To Succeed In Data Science. towardsdatascience.com/be-resourceful-one-of-the-most-important-skills-to-succeed-in-data-science-6ed5f33c2939/\nVery Well Mind. (n.d.). Locus of Control and Your Life. www.verywellmind.com/what-is-locus-of-control-2795434\nWikipedia. (2024). Locus of control. en.wikipedia.org/wiki/Locus_of_control\nZippia. (2023). The Most Important Resourcefulness Skills (With Examples). www.zippia.com/advice/resourcefulness-skills/"},"Connections-Habit":{"slug":"Connections-Habit","title":"Connections Habit","links":[],"tags":[],"content":"Mental Habit: Connected Thinking in Engineering Education\nConnected thinking can become a mental habit. While mental habits are widely recognized as different than mindset (Lynch &amp; Corbett , Momenipour &amp; O’Neil ), authors have linked mental habits and the development of entrepreneurial mindset.\nAs an illustration of connected thinking try the Connections Mini-Game. The idea was inspired by Gary Klein’s work on how we connect ideas to capture an insight. Klein’s work on insight, particularly in his book Seeing What Others Don’t: The Remarkable Ways We Gain Insights, emphasizes that insights often arise not from sudden flashes of brilliance but from connecting fragments of information in novel ways. His central thesis is that insight comes from recognizing contradictions, removing faulty assumptions, or spotting coincidences that others overlook. This process relies heavily on making connections—linking disparate cues, experiences, or patterns to form a new understanding. Klein argues that rather than waiting passively for insight, we can create the conditions for it by staying curious, noticing anomalies, and encouraging unconventional thinking.\n\n1. Description and Theoretical Framework\nDefinition and Importance\nConnected thinking is a mental habit characterized by the ability to perceive, analyze, and leverage relationships between concepts, systems, and disciplines. It involves recognizing patterns, understanding second and third-order effects, and creating mental models that represent complex systems and their interconnections. Connected thinking goes beyond linear cause-and-effect reasoning to embrace a more holistic view of engineering challenges.\nFor engineers, connected thinking is essential because engineering problems rarely exist in isolation. As engineering systems become increasingly complex and interdisciplinary, the ability to connect disparate concepts, anticipate cascading effects, and consider multiple perspectives becomes critical for effective problem-solving. Connected thinking enables engineers to move beyond reductionist approaches that might solve immediate problems but create unforeseen consequences.\nAccording to systems thinking theorists, connected thinking is particularly valuable because “in complex systems, higher order effects tend to dominate” (Hacker News, 2020). This insight highlights how the ability to anticipate and understand second and third-order relationships can be crucial in engineering contexts where simplistic first-order thinking might lead to suboptimal or even harmful solutions.\nThe authors of\nTheoretical Framework: The Dimensions of Connected Thinking\nConnected thinking in engineering can be conceptualized across three primary dimensions:\n\n\nRelational Dimension: The ability to identify and understand relationships between concepts, components, and systems.\n\nConcept-to-concept connections (how ideas relate to each other)\nComponent-to-component connections (how parts interact within a system)\nSystem-to-system connections (how different systems influence each other)\nDiscipline-to-discipline connections (how knowledge from different fields relates)\n\n\n\nTemporal Dimension: The ability to understand how systems and relationships evolve over time.\n\nFirst-order effects (immediate consequences)\nSecond-order effects (consequences of the first-order effects)\nThird-order effects (consequences of the second-order effects)\nFeedback loops (how effects cycle back to influence causes)\n\n\n\nRepresentational Dimension: The ability to create and use models that capture complex relationships.\n\nMental models (internal cognitive frameworks for understanding systems)\nConcept maps (external visual representations of relationships between ideas)\nSystem diagrams (representations of components and their interactions)\nCausal loop diagrams (representations of feedback processes)\n\n\n\nThis framework provides a structured way to understand connected thinking as a habit that can be systematically developed through engineering education. It recognizes that connected thinking involves both cognitive processes (how engineers perceive and analyze relationships) and representational tools (how they externalize and communicate those relationships to others).\n2. Engineering Education Applications\nDetailed Implementation: The Interconnected Systems Analysis Project\nOverview\nThe Interconnected Systems Analysis Project is a semester-long learning experience designed for third-year civil engineering students focused on urban infrastructure. This project develops connected thinking by requiring students to analyze the complex interdependencies between water, energy, and transportation systems in a real urban environment. Students create increasingly sophisticated models of system interactions and use these models to evaluate potential infrastructure interventions, with particular attention to second and third-order effects that might be overlooked in traditional siloed approaches.\nTechnical Setup and Materials\nPhysical and Digital Resources:\n\nGeographic Information System (GIS) software for mapping infrastructure systems\nSystem dynamics modeling software (e.g., STELLA or Vensim)\nData visualization tools (e.g., Tableau)\nMunicipal infrastructure data sets\nHistorical performance data for existing systems\nDemographic and socioeconomic data for the study area\nClimate projection data for the region\n\nReference Materials:\n\nConceptual frameworks for urban metabolism\nCase studies of infrastructure interdependencies\nMethodologies for multi-criteria decision analysis\nTemplates for system mapping and connection analysis\nRubrics for evaluating the depth and quality of connected thinking\n\nExpert Access:\n\nMunicipal engineers responsible for different infrastructure domains\nUrban planners familiar with the study area\nCommunity representatives who can speak to lived experiences\nFaculty with expertise in various infrastructure systems\n\nImplementation Process\nPhase 1: System Component Identification and Mapping (3 weeks)\n\n\nStudents are assigned to teams of 4-5 members, with each team focusing on a specific neighborhood within the urban area.\n\n\nTeams begin by mapping the three core infrastructure systems (water, energy, transportation) in their assigned area:\n\nWater infrastructure (supply, treatment, distribution, stormwater management)\nEnergy infrastructure (generation, transmission, distribution)\nTransportation infrastructure (roads, public transit, bike paths, pedestrian ways)\n\n\n\nFor each system, students identify:\n\nKey components and their functions\nService areas and capacities\nCritical nodes and potential vulnerabilities\nPerformance metrics and historical data\n\n\n\nStudents create initial GIS maps of each system, with layers that can be toggled to visualize different aspects of the infrastructure.\n\n\nTeams present their preliminary system maps to the class, receiving feedback on the comprehensiveness of their component identification.\n\n\nPhase 2: First-Order Connection Analysis (3 weeks)\n\n\nStudents analyze the direct connections between systems in their normal operations:\n\nEnergy required for water pumping and treatment\nWater required for energy generation\nTransportation networks needed for maintaining both systems\nShared rights-of-way and physical co-location of infrastructure\n\n\n\nTeams identify key performance interdependencies, such as:\n\nHow energy costs affect water delivery costs\nHow transportation congestion affects infrastructure maintenance\nHow water scarcity might affect energy generation\n\n\n\nStudents create connection matrices that quantify the strength and nature of these first-order relationships.\n\n\nTeams develop initial concept maps showing these direct relationships, using standardized notation for different types of connections.\n\n\nFaculty guide discussions on the importance of these connections for infrastructure planning and management.\n\n\nPhase 3: Second and Third-Order Effects Analysis (4 weeks)\n\n\nStudents extend their analysis to identify less obvious connections and cascading effects:\n\nHow water conservation might affect energy consumption and transportation patterns\nHow transportation electrification might affect both energy and water systems\nHow climate change impacts on one system might cascade to others\n\n\n\nTeams develop causal loop diagrams that show feedback relationships between systems, identifying:\n\nReinforcing loops (where changes amplify over time)\nBalancing loops (where systems self-regulate)\nTime delays (where effects are not immediately apparent)\n\n\n\nStudents use system dynamics modeling to simulate these relationships over time, observing how:\n\nShort-term interventions might have unexpected long-term consequences\nSmall changes in one system might produce large effects in others\nOptimal solutions might differ depending on the time horizon considered\n\n\n\nTeams identify potential tipping points and thresholds where gradual changes might lead to sudden system transformations.\n\n\nStudents create “connection trees” that map out chains of cause and effect across multiple systems and time scales.\n\n\nPhase 4: Intervention Design and Evaluation (4 weeks)\n\n\nEach team identifies a significant infrastructure challenge in their area (e.g., flooding, energy reliability, transit access) and proposes three potential interventions.\n\n\nFor each intervention, students use their connected thinking models to:\n\nPredict first-order impacts on the target system\nAnalyze second-order impacts on connected systems\nExplore third-order impacts and potential unintended consequences\nIdentify feedback effects that might amplify or dampen the intervention’s effectiveness\n\n\n\nTeams evaluate their interventions using multi-criteria decision analysis that explicitly considers:\n\nPerformance across all affected systems\nShort, medium, and long-term impacts\nDistributional effects across different communities\nResilience to different future scenarios\n\n\n\nStudents refine their system models based on this analysis, creating an integrated representation that captures the full complexity of system interdependencies.\n\n\nTeams prepare final reports and presentations that explicitly highlight:\n\nTheir evolving understanding of system connections\nHow considering higher-order effects changed their evaluation of interventions\nThe limitations of their models and areas of uncertainty\nHow connected thinking led to different conclusions than traditional siloed analysis\n\n\n\nLearning Outcomes and Habit Development\nThis implementation develops several key engineering competencies:\n\nSystems analysis: Students develop the ability to analyze complex urban infrastructure systems\nInterdisciplinary integration: Students learn to bridge traditionally separate domains of civil engineering\nDynamic modeling: Students gain experience with tools for representing and simulating change over time\nMulti-criteria decision-making: Students practice evaluating trade-offs across diverse objectives and stakeholders\n\nMost importantly, the experience systematically cultivates connected thinking as a habit by:\n\nProviding structured practice in identifying relationships at increasing levels of complexity\nCreating a learning environment where students directly experience the limitations of siloed thinking\nDemonstrating the practical value of understanding higher-order effects in engineering decision-making\nDeveloping fluency with representational tools that make complex connections visible and analyzable\n\nAssessment data from implementations of similar projects shows that students initially struggle to move beyond first-order thinking but gradually develop more sophisticated mental models that acknowledge system complexity. By the end of the semester, most teams demonstrate the ability to anticipate unexpected consequences and leverage system interdependencies in their design proposals.\n3. Assessment and Measurement\nIndicators of Connected Thinking as a Mental Habit\nObservable behaviors that indicate connected thinking has become habitual in engineering students include:\n\nSpontaneously identifying relationships between concepts from different courses or disciplines\nAsking questions about second and third-order effects without prompting\nCreating concept maps or diagrams to think through complex problems\nConsidering feedback loops and system dynamics in problem analysis\nLooking beyond immediate technical solutions to broader system implications\nIdentifying potential unintended consequences of proposed interventions\nDrawing analogies between seemingly different engineering contexts\nRecognizing patterns across diverse engineering problems\nCommunicating effectively about complex systems and their behaviors\nProposing interventions that leverage system interconnections rather than fighting them\n\nAssessment Methods\n1. Concept Map Analysis Concept maps created by students can be analyzed for indicators of connected thinking, including the number of valid connections identified, the hierarchical structure of the map, and the cross-links between different branches (Academia.edu, 2014). Research shows that concept maps provide “an effective way to get students to interact with content to make connections at a more sophisticated level” (ASU Learning and Teaching Hub, 2024).\n2. System Model Evaluation Students’ ability to create accurate and useful models of complex systems can be assessed using rubrics that evaluate both the structure of the models and their utility for predicting system behavior. These evaluations can focus on whether students appropriately capture key relationships, feedback loops, and time delays.\n3. Second-Order Thinking Exercises Specific exercises can be designed to test students’ ability to identify second and third-order effects. For example, students might be presented with a case study of an engineering intervention and asked to trace its potential cascading effects across multiple systems and time scales.\n4. Connection Identification Tests Students can be given sets of seemingly unrelated engineering concepts and asked to identify valid connections between them. The quality, quantity, and creativity of the connections can provide insight into the development of connected thinking habits.\n5. Reflection Analysis Students’ reflective writings about their problem-solving processes can be analyzed for evidence of connected thinking, such as references to system relationships, consideration of multiple time horizons, and awareness of potential unintended consequences.\n6. Design Critique Observations During design reviews or critiques, observers can document instances where students demonstrate connected thinking in their presentations or responses to questions, providing a more naturalistic assessment of this habit in action.\n4. Challenges and Considerations\nPotential Barriers\n1. Disciplinary Silos in Engineering Education Traditional engineering education often organizes knowledge into discrete courses with limited integration, making it difficult for students to develop the habit of connected thinking across domains. As noted in research, helping students understand “the overall conceptual structure of the course” and seeing connections to other areas of curriculum remains challenging (ResearchGate, 2018).\n2. Limited Tools for Representing Complex Systems While there are various tools for representing relationships (concept maps, system diagrams, etc.), students may not have sufficient practice with these tools to use them effectively for complex engineering problems. Learning to create effective representations is itself a skill that requires significant time and guidance.\n3. Assessment Constraints Traditional engineering assessments often focus on discrete technical knowledge rather than connected thinking, potentially sending mixed messages about what is valued. Developing valid and reliable methods for assessing connected thinking remains challenging.\n4. Time Pressure in Curriculum The habit of connected thinking requires time for reflection and exploration, which may be at odds with packed engineering curricula focused on covering technical content. Faculty may feel they cannot “afford” the time needed for students to develop this habit properly.\n5. Comfort with Abstraction Connected thinking often involves abstract concepts and relationships that some students find challenging. Different cognitive preferences and learning styles may affect how readily students develop this habit.\nMitigation Strategies\n1. Integrated Problem-Based Learning Creating learning experiences that intentionally span traditional disciplinary boundaries can help students develop the habit of connected thinking. Problem-based learning approaches that address complex, real-world challenges naturally require students to make connections across domains.\n2. Explicit Concept Mapping Instruction Providing direct instruction in concept mapping and other representational tools can help students develop the skills needed for external representation of their connected thinking. Research has shown that “concept maps help students to learn in a non-linear way promoting out-of-the-box thinking” (ResearchGate, 2018).\n3. Scaffolded Practice Starting with simpler connection exercises and gradually increasing complexity can help students build confidence in their connected thinking abilities. Providing templates and examples of well-constructed concept maps or system diagrams can give students models to emulate.\n4. Faculty Development Helping engineering faculty recognize the value of connected thinking and develop strategies for fostering it in their courses can create more consistent messaging about its importance. Faculty workshops on concept mapping and systems thinking can provide concrete tools for implementation.\n5. Authentic Assessment Design Developing assessments that explicitly value and reward connected thinking can help align curriculum, pedagogy, and evaluation. Rubrics that include criteria for the quality and depth of connections identified can make expectations clear to students.\n5. References\nAcademia.edu. (2014). Concept Maps In Engineering Education: A Case Study. Retrieved from www.academia.edu/473924/Concept_Maps_In_Engineering_Education_A_Case_Study\nASU Learning and Teaching Hub. (2024). Concept Maps. Retrieved from lth.engineering.asu.edu/reference-guide/concept-maps/\nClear, J. (2018). Mental Models: Learn How to Think Better and Gain a Mental Edge. Retrieved from jamesclear.com/mental-models\nHacker News. (2020). Mental Model: Second Order Thinking. Retrieved from news.ycombinator.com/item\nMerritt, J. (2018). What Are Mental Models? Part 2. The Systems Thinker. Retrieved from thesystemsthinker.com/what-are-mental-models-part-2/\nMerritt, J. (2016). What Are Mental Models? The Systems Thinker. Retrieved from thesystemsthinker.com/what-are-mental-models/\nModelThinkers. (n.d.). Second-Order Thinking. Retrieved from modelthinkers.com/public/mental-model/second-order-thinking\nNCBI. (n.d.). Concept Maps for Teaching, Training, Testing and Thinking. Retrieved from pmc.ncbi.nlm.nih.gov/articles/PMC10702656/\nPEER ASEE. (n.d.). Utilizing Concept Maps to Improve Engineering Course Curriculum in Teaching Mechanics. Retrieved from peer.asee.org/utilizing-concept-maps-to-improve-engineering-course-curriculum-in-teaching-mechanics\nResearchGate. (2018). Case Study on Effective Use of Mind Map in Engineering Education. Retrieved from www.researchgate.net/publication/329954185_Case_Study_on_Effective_Use_of_Mind_Map_in_Engineering_Education\nResearchGate. (2016). Higher education provision using systems thinking approach - case studies. Retrieved from www.researchgate.net/publication/306361753_Higher_education_provision_using_systems_thinking_approach_-_case_studies\nSixSigma.us. (2024). Applications of Systems Thinking. Retrieved from www.6sigma.us/systems-thinking/systems-thinking-framework/\nSenge, P. (1990). The Fifth Discipline: The Art and Practice of the Learning Organization. New York: Doubleday.\nScienceDirect. (n.d.). Self-associated concept mapping for representation, elicitation and inference of knowledge. Retrieved from www.sciencedirect.com/science/article/abs/pii/S0950705106001948\nWikipedia. (2025). Mental model. Retrieved from en.wikipedia.org/wiki/Mental_model"},"Creating-Value-Habit":{"slug":"Creating-Value-Habit","title":"Creating Value Habit","links":[],"tags":[],"content":"Mental Habit: Value-Creation Thinking in Engineering Education\n\nFigure from valohai.com/blog/managing-ai-products/\n\nTry the game to add an INNOVATION force among other forces  as you navigate the Value Tensions.\n\nThe innovation sweet spot is a concept popularized by IDEO and often credited to the field of design thinking. It illustrates the intersection of Desirability (what people want), Feasibility (what is technically possible), and Viability (what is economically sustainable). The dark center—where all three circles overlap—represents the “sweet spot” where innovation efforts are most likely to lead to meaningful, impactful solutions.\nAt its core, this model encourages a mental habit of value creation. It reflects a mindset that constantly asks, “Who benefits?” and “Is this solution desirable, doable, and sustainable?” When engineers, designers, or entrepreneurs internalize this habit, they develop a kind of cognitive radar for opportunity—attuned not only to technological possibility but also to human need and real-world constraints.\nCreating value isn’t just about good ideas or clever products. It’s about cultivating a habit of mind that listens deeply, connects insightfully, and executes thoughtfully. This model serves as a reminder that true innovation occurs when we align our technical creativity with human-centered intent and market realities.\nReference: See Tim Brown’s Change by Design (Harvard Business Press, 2009) and resources from IDEO.org. Also see the Stanford d.school’s teaching materials, where students are taught to iterate solutions within the overlap of desirability, feasibility, and viability.\n1. Description and Theoretical Framework\nDefinition and Importance\nValue-creation thinking is a mental habit marked by an intentional focus on others—on stakeholders, users, and society—as the primary lens through which engineers identify opportunities and design solutions. It is the habit of consistently asking, “Who will this benefit? In what ways? At what cost?” and seeking to increase that benefit in meaningful, sustainable, and innovative ways.\nIn contrast to problem-solving that focuses inward on technical mastery alone, value-creation thinking directs attention outward. This outward orientation includes curiosity about others’ needs, empathetic engagement, and a proactive drive to deliver solutions that are useful, desirable, and impactful. Engineers with this habit are not only capable of solving complex problems—they are motivated to solve the right problems, in the right way, for the right reasons.\nCreating value requires both opportunity recognition (seeing unmet needs or possibilities) and opportunity shaping(transforming insights into feasible, valuable actions). According to Saras Sarasvathy’s effectuation theory, expert entrepreneurs begin with available means and iteratively co-create opportunities with stakeholders, emphasizing affordable loss and stakeholder commitment. This aligns with value-creation thinking as a habit of working with others, not just for them.\n\n2. Theoretical Framework: The Dimensions of Value-Creation Thinking\n1. Empathic Dimension: The capacity to understand others’ perspectives, constraints, hopes, and lived experiences.\n\n\nActive listening and stakeholder interviews\n\n\nPersonas and journey maps to surface latent needs\n\n\nSocial, ethical, and emotional considerations\n\n\n2. Opportunity Dimension: The ability to notice, generate, and frame opportunities through a value lens.\n\n\nIdentifying problems worth solving\n\n\nSeeing patterns in complaints, inefficiencies, or underutilized assets\n\n\nReframing problems as latent opportunities\n\n\n3. Value Articulation Dimension: The discipline to clearly express value in terms of outcomes for others.\n\n\nUse of frameworks like NABC (Need, Approach, Benefit per Cost, Competition)\n\n\nThinking in terms of societal, economic, and personal value\n\n\nWeighing trade-offs and sustainability\n\n\n4. Co-Creation Dimension: The mindset that solutions are best developed with stakeholders, not in isolation.\n\n\nIterative prototyping and feedback cycles\n\n\nShared ownership of both problem and solution\n\n\nViewing engineering as a relational act of service and stewardship\n\n\n\n3. Engineering Education Applications\nCase Example: “Engineering for Others” Studio Course\nOverview: A sophomore-level design studio pairs engineering students with local non-profits, clinics, or community groups. Over 10 weeks, student teams work with these partners to identify a challenge, explore possible interventions, and co-create a prototype that meets a real need.\nImplementation Phases:\n\n\nDiscover Phase (2 weeks)\n\n\nField observations, interviews, and empathy maps\n\n\nStudents reflect on whose life they hope to improve, and why\n\n\n\n\nDefine &amp; Frame (2 weeks)\n\n\nStudents develop multiple problem framings using value-centric tools like Value Proposition Canvas or NABC\n\n\nTeams identify both obvious and non-obvious value recipients\n\n\n\n\nDesign &amp; Test (4 weeks)\n\n\nStudents prototype, test, and revise in partnership with stakeholders\n\n\nFeedback is emphasized over perfection\n\n\n\n\nDeliver &amp; Reflect (2 weeks)\n\n\nFinal presentations center on impact: Who benefits? How will this change their experience?\n\n\nStudents write personal reflections on what it means to create value as an engineer\n\n\n\n\n\n4. Indicators of Value-Creation Thinking as a Mental Habit\nObservable Behaviors:\n\n\nProactively identifying beneficiaries of a technical solution\n\n\nAsking value-oriented questions during design: “What difference will this make? For whom?”\n\n\nFraming technical solutions in terms of real human or societal outcomes\n\n\nSeeking feedback and iterating based on stakeholder insight\n\n\nExpressing pride not only in technical elegance but also in value delivered\n\n\nChallenging solutions that are technically sound but misaligned with actual needs\n\n\nAssessment Tools:\n\n\nStakeholder Value Mapping Exercises: Track how students identify and refine value propositions for diverse users.\n\n\nReflection Prompts: Analyze students’ reflections for language around empathy, usefulness, and social good.\n\n\nPitch Rubrics: Evaluate students’ ability to articulate value using frameworks like NABC.\n\n\nPeer and Stakeholder Feedback: Solicit input on whether students’ solutions actually delivered value.\n\n\n\n5. Challenges and Mitigation Strategies\nChallenges\n\n\nStudents often default to designing what they would use, not what others need\n\n\nTechnical focus may crowd out value framing in time-pressured curricula\n\n\nEmpathy and co-creation may feel “soft” or less rigorous\n\n\nStrategies\n\n\nUse real-world projects with authentic stakeholders\n\n\nProvide value-oriented design templates and reflection scaffolds\n\n\nElevate stories and examples of engineers creating transformative value\n\n\nInclude value-creation explicitly in rubrics and grading criteria\n\n\n\n6. Conclusion\nDeveloping value-creation thinking as a mental habit requires deliberate practice in empathy, opportunity framing, stakeholder engagement, and purposeful communication. For engineering educators, fostering this habit means more than adding a lesson on ethics or impact. It means helping students develop an orientation toward others—toward listening, toward service, and ultimately, toward making the world better through engineering."},"Curiosity-Habit":{"slug":"Curiosity-Habit","title":"Curiosity Habit","links":[],"tags":[],"content":"Mental Habit: Curiosity in Engineering Education\n1. Description and Theoretical Framework\nDefinition and Importance\nCuriosity is a mental habit characterized by a strong desire to explore, investigate, and learn that drives individuals to ask questions, seek new information, and develop deeper understanding. In STEM fields, curiosity acts as “the fuel of learning” that powers engagement with “fascinating phenomena, challenging problems, and creative solutions”. As a mental habit, curiosity represents a consistent pattern of thinking that can be cultivated through regular practice and appropriate environmental conditions.\nTheoretical Framework: Wendy Wood’s Context-Trigger-Reward Model\nAccording to Wendy Wood’s research, habits comprise approximately 43% of our everyday actions, though we often mistakenly perceive these as conscious choices rather than responses triggered by contextual cues. For curiosity to become habitual in engineering education, it needs:\n\nContext: Learning environments that normalize questioning and exploration\nTrigger: Stimuli that prompt inquisitive responses (novel problems, unexpected results)\nReward: Satisfaction from discovering new insights or solving problems\n\nThis framework aligns with similar work by James Clear (Atomic Habits) and Charles Duhigg (The Power of Habit), all emphasizing the importance of environmental cues, consistent practice, and rewarding feedback for habit formation.\nResearch Support\nResearch has identified different elements of inquisitiveness, including “(1) an inclination to criticize, (2) an inclination to understand, (3) an inclination to achieve, (4) an inclination to share, (5) an inclination to innovate, and (6) a desire to know”. These dimensions provide a framework for understanding how curiosity manifests and can be measured in educational settings.\nSome researchers distinguish between curiosity as a stable trait versus a state feature (which varies by situation). However, others argue that curiosity is not a fixed personality trait equal across contexts, suggesting it can be developed through appropriate educational interventions.\n2. Engineering Education Applications\nDetailed Implementation: The Anomalous Materials Testing Lab\nOverview\nThis implementation strategy creates a structured yet open-ended laboratory experience where engineering students encounter unexpected material testing results that contradict established theory or previous understanding. The experience is specifically designed to trigger curiosity by presenting students with anomalies that cannot be explained through standard textbook knowledge.\nTechnical Setup and Materials\nEquipment Required:\n\nUniversal Testing Machine (UTM) capable of tension, compression, and flexural testing\nDigital Image Correlation (DIC) system for strain mapping\nVarious material specimens including:\n\nAluminum alloy specimens (6061-T6) with controlled microstructural variations\nCarbon fiber reinforced polymer (CFRP) samples with deliberately introduced defects\n3D-printed polymer specimens with varying infill patterns and densities\n\n\nData acquisition system with real-time graphing capabilities\nOptical microscopes for post-failure analysis\n\nPre-lab Preparation:\n\n\nPrepare specimens with specific, controlled anomalies:\n\nHeat-treated aluminum specimens with varying cooling rates to create different precipitate distributions\nCFRP samples with deliberately misaligned fibers in specific regions\n3D-printed specimens with intentional internal voids not visible from the surface\n\n\n\nCreate baseline data showing “expected” stress-strain behavior for each material type based on textbook properties and standard testing procedures.\n\n\nImplementation Process\nPhase 1: Standard Testing and Predictions (1 week)\n\nStudents conduct literature review on mechanical properties of the selected materials\nTeams develop predictions for failure modes and mechanical properties based on established theory\nStudents document their predictions including expected:\n\nYield strengths\nUltimate tensile strengths\nElastic moduli\nFailure mechanisms and locations\n\n\n\nPhase 2: Anomalous Testing Experience (2 weeks)\n\n\nStudents perform standardized ASTM testing procedures on their specimens\n\n\nAs testing progresses, the intentionally modified specimens produce unexpected results:\n\nPremature failures\nUnusual stress-strain curves\nUnexpected fracture locations\nNon-uniform strain distributions visible in DIC data\n\n\n\nCritical moment: When results contradict predictions, instructors avoid providing explanations, instead asking:\n\n“What might explain these unexpected results?”\n“What additional information would you need to understand what’s happening?”\n“How might you modify your testing approach to investigate further?”\n\n\n\nPhase 3: Curiosity-Driven Investigation (3 weeks)\n\nTeams develop investigation plans based on their specific anomalies\nStudents request additional testing equipment or procedures (microscopy, chemical analysis, etc.)\nTeams design and conduct follow-up experiments, with instructor guidance limited to safety and technical support\nStudents document their evolving questions and hypotheses as their investigation proceeds\n\nPhase 4: Analysis and Communication (2 weeks)\n\nTeams analyze findings and develop evidence-based explanations for their anomalies\nStudents prepare technical reports and presentations focusing on:\n\nInitial predictions and assumptions\nObserved anomalies\nInvestigation process\nProposed explanations\nEngineering implications\n\n\nFinal presentations include reflection on how their curiosity evolved throughout the process\n\nEngineering Learning Outcomes\nThis laboratory experience develops several critical engineering competencies:\n\nMaterials characterization skills: Students gain hands-on experience with testing methods while learning to question standardized procedures\nFailure analysis expertise: Students develop systematic approaches to diagnosing unexpected material behavior\nExperimental design abilities: The open-ended investigation requires students to design their own testing protocols\nTechnical communication skills: Students must clearly communicate complex technical findings, including both processes and conclusions\n\nMost importantly, the experience cultivates curiosity as a professional habit by:\n\nNormalizing the questioning of established knowledge\nRewarding persistent investigation rather than quick answers\nCreating a context where curiosity is the expected response to unexpected observations\nProviding the technical tools necessary to pursue engineering curiosity in a structured way\n\nThis approach has been successfully implemented in materials engineering courses at both undergraduate and graduate levels, with assessment data showing increased student confidence in designing investigations and a greater tendency to question assumptions in subsequent coursework.\n3. Assessment and Measurement\nIndicators of Curiosity as a Mental Habit\nObservable behaviors that indicate curiosity has become habitual include:\n\nSpontaneous questioning beyond assignment requirements\nIndependent information seeking\nConnecting ideas across different domains\nProposing multiple hypotheses for observed phenomena\nChallenging established explanations with evidence\nPersistent refinement of understanding\nSharing discoveries enthusiastically with peers\n\nAssessment Methods\n1. Curiosity Questionnaires Research has used “shortened version[s] of validated questionnaire[s]” containing specific questions designed to measure different aspects of inquisitiveness.\n2. Behavioral Observation Track student behaviors associated with curiosity, such as question-asking frequency, voluntary information seeking, and willingness to explore multiple solutions.\n3. Project Documentation Analysis Examine student engineering notebooks, design journals, or process documentation for evidence of curiosity-driven exploration, such as questions posed, information sources consulted, and alternative solutions considered.\n4. Reflective Self-Assessment Have students maintain reflection journals documenting their own curiosity journey, including moments of intellectual spark, questions pursued, and insights gained.\n4. Challenges and Considerations\nPotential Barriers\n1. Time Constraints When implementing curiosity-focused approaches, “clear lesson plan[s] and learning objectives” must be balanced with “deviation and spontaneity” to allow exploration while ensuring learning goals are met.\n2. Assessment Pressures Traditional assessment systems may unintentionally discourage curiosity by rewarding quick, correct answers rather than thoughtful exploration and questioning.\n3. Comfort with Uncertainty Both educators and students may feel uncomfortable with the ambiguity that often accompanies curiosity-driven learning, preferring the security of clear, predetermined answers.\n4. Prior Educational Conditioning Students may come from backgrounds “where making mistakes is a negative thing” or where “sitting quietly and listening to instruction was the expected and encouraged thing to do,” making them hesitant to engage in curious exploration.\nMitigation Strategies\n1. Gradual Implementation Begin with small, structured curiosity activities to build comfort before expanding to more open-ended exploration.\n2. Explicit Valuing of Process Adjust assessment to reward thoughtful questioning and exploration as much as correct solutions.\n3. Growth Mindset Integration Help students develop a growth mindset where they “believe that knowledge and understanding are gained through perseverance, hard work, and effort,” making them more willing to engage in curious exploration.\n4. Teacher Professional Development Recognize that “curiosity is a habit that you can train for” and ensure educators have the support to develop their own curiosity habits before fostering them in students.\n5. References\nCarden, L., &amp; Wood, W. (2018). Habit formation and change. Current Opinion in Behavioral Sciences, 20, 117–122.\nClear, J. (2018). Atomic Habits: An Easy &amp; Proven Way to Build Good Habits &amp; Break Bad Ones. Avery.\nDuhigg, C. (2012). The Power of Habit: Why We Do What We Do in Life and Business. Random House.\nEngineering Unleashed. (n.d.). CURIOSITY: What do we mean? Retrieved from engineeringunleashed.com/card/1493\nFeel Good Teaching. (2023). 5 Ideas for Teaching Character Ed, Curiosity &amp; the 4 Cs of Engineering in STEM Classes. Retrieved from www.feelgoodteaching.com/2023/08/5-stem-ideas-for-teaching-character-ed-curiosity-4-cs-of-engineering.html\nFormation.dev. (2023). Engineering starts with curiosity. Retrieved from formation.dev/blog/engineering-starts-with-curiosity/\nKnowles Teacher Initiative. (2023). Creating A Curious Classroom Using Science And Engineering Practices. Retrieved from knowlesteachers.org/kaleidoscope/creating-a-curious-classroom-using-science-and-engineering-practices\nResilient Educator. (2020). Education as Habit Formation. Retrieved from resilienteducator.com/instructional-design/education-as-habit-formation/\nTeach Starter. (2021). 7 Tips for Teaching Curiosity in the Classroom. Retrieved from www.teachstarter.com/au/blog/7-tips-for-teaching-curiosity-3/\nvan Rijst, R. M., van der Rijst, R. M., &amp; Jacobi, R. K. (2018). Research Education Nurtures Inquisitiveness of Professional Design and Engineering Students. In proceedings of the international conference on engineering and product design education (E&amp;PDE, 2018).\nWood, W., Mazar, A., &amp; Neal, D. T. (2022). Habits and Goals in Human Behavior: Separate but Interacting Systems. Perspectives on Psychological Science."},"Habits-Document":{"slug":"Habits-Document","title":"Habits Document","links":[],"tags":[],"content":""},"Impact-Habit":{"slug":"Impact-Habit","title":"Impact Habit","links":[],"tags":[],"content":"Mental Habit: Impact Thinking in Engineering Education\n1. Description and Theoretical Framework\nDefinition and Importance\nImpact thinking is a mental habit characterized by the ability to anticipate, analyze, and evaluate the potential long-term and multifaceted consequences of engineering decisions and designs. This habit involves systematically considering how engineering choices might affect various stakeholders, environments, and systems over different time horizons—from immediate effects to consequences that might unfold decades later.\nFor engineers, impact thinking is essential because their designs and decisions often have far-reaching implications that extend well beyond the immediate technical problem. As noted in recent research, engineering education must equip students to “consider both the short-term and long-term consequences” of their work to “ensure a strong financial future” while addressing “social, economic, and environmental responsibility” Zoe Talent Solutions (2023). The development of impact thinking as a habit helps engineers balance competing interests, identify potential unintended consequences, and make decisions that align with sustainability goals and ethical principles.\nTheoretical Framework: The Temporal-Spatial-Ethical Matrix\nThe development of impact thinking can be conceptualized through a three-dimensional matrix that engineers can use to evaluate potential consequences:\n\n\nTemporal Dimension: Considering impacts across different time frames:\n\nImmediate effects (during implementation)\nShort-term effects (1-5 years)\nMedium-term effects (5-20 years)\nLong-term effects (20+ years)\nIntergenerational effects\n\n\n\nSpatial Dimension: Considering impacts across different scales:\n\nLocal effects (immediate vicinity)\nRegional effects (surrounding communities)\nNational effects (policy and societal impacts)\nGlobal effects (international and planetary impacts)\n\n\n\nEthical Dimension: Considering impacts across different stakeholders:\n\nUser/client impacts\nCommunity impacts\nEnvironmental impacts\nEconomic impacts\nSocial justice impacts\n\n\n\nThis framework helps engineers develop the habit of thinking broadly and deeply about the implications of their work. By regularly practicing this three-dimensional analysis, engineering students can internalize impact thinking as an automatic cognitive process that becomes second nature in their professional practice.\nEngineering educators have recognized that developing this habit requires “integrating practice and application” Nature (2024) and training students to “understand that their beliefs or understanding of a concept may be incorrect” Brower (2023). Impact thinking thus requires both intellectual humility and systems thinking approaches that challenge engineers to move beyond narrow technical solutions.\n2. Engineering Education Applications\nDetailed Implementation: The Watershed Infrastructure Impact Analysis Project\nOverview\nThe Watershed Infrastructure Impact Analysis Project is a semester-long course activity designed for third-year civil engineering students that develops impact thinking through the analysis of proposed water management infrastructure. Students evaluate a proposed stormwater management system through multiple lenses of time, space, and stakeholder impacts, training them to habitually consider the broader implications of engineering decisions.\nTechnical Setup and Materials\nProject Resources:\n\nDetailed case study of a proposed urban stormwater management system including:\n\nTechnical specifications (pipe sizes, detention basin dimensions, etc.)\nInitial environmental impact assessment\nProject budget and timeline\nMaps of the watershed and surrounding communities\nHistorical rainfall and flooding data\nDemographic and socioeconomic data for affected areas\nLand use and development plans\n\n\n\nTechnical Tools:\n\nHydrologic modeling software (HEC-HMS)\nGIS mapping tools\nLife cycle assessment software\nMulti-criteria decision analysis tools\nSystems dynamics modeling tools\nInfrastructure resilience assessment frameworks\n\nSupporting Materials:\n\nDecision matrices for temporal-spatial-ethical impact evaluation\nStakeholder identification templates\nImpact uncertainty assessment guides\nLong-term projection methodologies\n\nImplementation Process\nPhase 1: Technical Analysis and Baseline Projection (3 weeks)\n\nStudents conduct a traditional engineering analysis of the proposed stormwater system:\n\nHydrologic performance under current design storm conditions\nStructural integrity and material specifications\nCompliance with current codes and regulations\nCost-benefit analysis using standard metrics\n\n\nTeams develop a baseline projection of system performance over a 50-year design life assuming stationary conditions:\n\nPhysical deterioration and maintenance requirements\nBasic performance metrics under design conditions\nStandard economic return on investment calculations\n\n\n\nPhase 2: Expanded Impact Horizon Analysis (4 weeks)\n\n\nStudents systematically expand their impact analysis using the temporal-spatial-ethical matrix:\n\nTemporal Expansion: Teams project consequences under changing climate scenarios, with consideration of:\n\nIncreased rainfall intensity and frequency\nChanges in development patterns over decades\nInfrastructure aging and degradation\nShifts in regulatory requirements\n\n\nSpatial Expansion: Teams analyze impacts beyond the immediate project area, including:\n\nDownstream communities\nRegional watershed effects\nImpacts on adjacent natural systems\nConnectivity to other infrastructure systems\n\n\nStakeholder Expansion: Teams identify impacts across diverse stakeholders:\n\nEnvironmental justice considerations for neighborhoods of different socioeconomic status\nIntergenerational equity in maintenance burdens\nWildlife and ecosystem impacts\nImpacts on future development options\n\n\n\n\n\nWeekly “Impact Horizon Expansion” sessions where teams are challenged to identify consequences they hadn’t previously considered\n\n\nPhase 3: Alternative Solutions and Trade-off Analysis (4 weeks)\n\n\nTeams develop alternative designs that might better address the expanded impact considerations:\n\nGreen infrastructure alternatives\nDistributed vs. centralized approaches\nAdaptive management strategies\nHybrid gray-green infrastructure solutions\n\n\n\nStudents conduct comparative impact analyses of alternatives using:\n\nMulti-criteria decision analysis\nStakeholder value mapping\nResilience assessment\nIntergenerational equity metrics\n\n\n\nTeams explicitly identify trade-offs between competing values and stakeholders:\n\nCurrent costs vs. future benefits\nTechnical efficiency vs. environmental impact\nReliability vs. adaptability\nQuantifiable vs. non-quantifiable impacts\n\n\n\nPhase 4: Decision Recommendation and Reflection (3 weeks)\n\n\nTeams develop final recommendations that explicitly address:\n\nKnown impacts across all dimensions of the matrix\nUncertainties and potential unintended consequences\nOpportunities for adaptive management\nMonitoring recommendations for unanticipated impacts\n\n\n\nEach student completes an individual reflection on how their thinking evolved:\n\nInitial vs. final impact considerations\nSurprises encountered during the expanded analysis\nValue conflicts identified and how they were addressed\nHow they would approach future engineering projects differently\n\n\n\nFinal presentation to a panel including:\n\nProfessional engineers\nCommunity representatives\nEnvironmental advocates\nMunicipal officials\n\n\n\nEngineering Learning Outcomes\nThis project develops several essential engineering competencies:\n\nTechnical Analysis: Students gain experience with hydrologic modeling, infrastructure design, and performance assessment\nSystems Thinking: Students develop the ability to understand interconnected effects across natural and built systems\nStakeholder Analysis: Students learn to identify and consider diverse stakeholders affected by engineering decisions\nUncertainty Management: Students practice making decisions with incomplete information about future conditions\n\nMost importantly, the project cultivates impact thinking as a mental habit by:\n\nCreating a structured method for expanding consideration beyond immediate technical performance\nProviding repeated practice in identifying “non-obvious” consequences\nDeveloping cognitive frameworks that can be applied to future engineering decisions\nNormalizing the inclusion of long-term and broad-scale impacts in engineering analysis\n\nThe project has been successfully implemented in civil engineering programs, with assessment data showing that students who complete the project demonstrate significantly increased consideration of long-term impacts and stakeholder concerns in subsequent design projects compared to students who received traditional engineering education.\n3. Assessment and Measurement\nIndicators of Impact Thinking as a Mental Habit\nObservable behaviors that indicate impact thinking has become habitual in engineering students include:\n\nSpontaneous consideration of long-term consequences without prompting\nAutomatic identification of diverse stakeholders affected by decisions\nRegular questioning of assumptions about future conditions\nIntegration of impact analysis into initial design phases rather than as an afterthought\nRecognition of interconnections between technical decisions and broader systems\nConsideration of both quantifiable and non-quantifiable impacts\nAcknowledgment of value conflicts and ethical dimensions in technical decisions\n\nAssessment Methods\n1. Impact Horizon Mapping Students can be asked to create conceptual maps showing the potential consequences of an engineering decision across different time horizons, physical scales, and stakeholder groups. These maps can be assessed for comprehensiveness, depth, and identification of non-obvious impacts.\n2. Reflective Journals Regular reflective journal entries can document how students’ consideration of impacts evolves over time. These journals can be analyzed for growth in the breadth and depth of impact considerations.\n3. Decision Justification Analysis When making design choices, students can be required to provide written justifications that explicitly address anticipated impacts. These justifications can be assessed for the range of impacts considered and the depth of analysis.\n4. Multi-Criteria Decision Analysis Students can be assessed on their ability to develop and apply appropriate criteria for evaluating engineering alternatives that incorporate diverse impacts and stakeholder values.\n5. Scenario Testing Students can be presented with novel engineering scenarios and assessed on their ability to quickly identify potential impacts across different dimensions without specific prompting to do so.\n6. Pre/Post Surveys Validated instruments can measure changes in students’ attitudes toward considering long-term and broad-scale impacts of engineering decisions before and after educational interventions.\n4. Challenges and Considerations\nPotential Barriers\n1. Technical Focus in Engineering Education Traditional engineering education often emphasizes technical problem-solving with less attention to broader impacts, creating resistance to incorporating impact thinking Tandfonline (2009). Faculty and students may view impact analysis as “soft” or peripheral to “real” engineering.\n2. Prediction Uncertainty Analyzing long-term impacts involves inherent uncertainties that can make students uncomfortable and lead them to avoid such analysis altogether. The challenges of making reliable long-term predictions can discourage systematic impact thinking.\n3. Complexity and Cognitive Load Impact thinking requires consideration of multiple dimensions simultaneously, creating high cognitive load. Students may resort to simplistic analyses when faced with overwhelming complexity.\n4. Disciplinary Silos Engineering education often occurs in disciplinary silos, whereas effective impact thinking requires interdisciplinary perspectives and knowledge that crosses traditional boundaries.\n5. Assessment Challenges Traditional engineering assessment methods (exams, problem sets) may not effectively measure impact thinking abilities, making it difficult to evaluate and reinforce this habit.\nMitigation Strategies\n1. Integrating Impact Analysis Throughout Curriculum Rather than treating impact thinking as a separate topic, it should be integrated into technical courses from the beginning. Faculty can model impact thinking in how they present technical content.\n2. Embracing Uncertainty Engineering education should explicitly teach methods for making decisions under uncertainty and help students become comfortable with probabilistic and scenario-based approaches to future impacts.\n3. Scaffolded Complexity Students need scaffolded experiences that gradually increase in complexity, starting with simpler impact analyses and building toward more comprehensive approaches as they develop the cognitive frameworks to manage them.\n4. Interdisciplinary Collaboration Engineering programs can partner with other disciplines (environmental studies, sociology, public policy) to provide students with multiple perspectives on impact assessment. These collaborations help students develop more holistic viewpoints on engineering impacts.\n5. Authentic Assessment Assessment methods should include realistic engineering scenarios where impact thinking is essential. Industry partners can help develop and evaluate authentic assessment tasks that mirror real-world decision contexts.\n5. References\nBrower, E. (2023). How Classrooms Can Promote Intellectual Humility—Or Discourage It. Greater Good Berkeley. greatergood.berkeley.edu/article/item/how_classrooms_can_promote_intellectual_humility_or_discourage_it\nHerreid, C. F., Schiller, N. A., &amp; Herreid, K. F. (2021). Case studies and the flipped classroom. Journal of College Science Teaching, 42(5), 62-66.\nIEEE (2022). New Identity of Engineering in 21st Century: Social Responsibility and Sustainability in Engineering Education. IEEE Teaching Excellence Hub. teaching.ieee.org/social-responsibility-and-sustainability-in-engineering-education/\nMotion Drives and Controls (2024). The Role of Sustainability in Engineering. www.motiondrivesandcontrols.co.uk/blog/engineering-ethics-and-its-impact-on-society\nNational Academy of Engineering. (2004). Emerging Technologies and Ethical Issues in Engineering: Papers from a Workshop. Washington, DC: The National Academies Press. nap.nationalacademies.org/read/11083/chapter/7\nScience Direct (2023). Empowering students’ engineering thinking: An empirical study of integrating engineering into science class at junior secondary schools. www.sciencedirect.com/science/article/abs/pii/S1871187123001323\nSustainability (2020). Innovation in Engineering Education for Sustainable Development—Introduction to a Special Issue. MDPI. www.mdpi.com/2071-1050/12/19/8132\nTandfonline (2009). A historico-ethical perspective on engineering education: from use and convenience to policy engagement. www.tandfonline.com/doi/full/10.1080/19378620902725166\nThe Ethical Engineer (2017). Engineering Ethics and Its Impact on Society. Texas Tech University. ethicalengineer.ttu.edu/articles/engineering-ethics-and-its-impact-on-society\nYale Poorvu Center for Teaching and Learning (2024). Case-Based Learning. poorvucenter.yale.edu/strategic-resources-digital-publications/strategies-teaching/case-based-learning\nZoe Talent Solutions (2023). Balancing short-term Profitability with long-term Sustainability in Business Management. zoetalentsolutions.com/balancing-short-term-profitability-with-long-term-sustainability-in-business-management/"},"Inquisitive-Habit":{"slug":"Inquisitive-Habit","title":"Inquisitive Habit","links":[],"tags":[],"content":""},"Intellectual-Humility-Habit":{"slug":"Intellectual-Humility-Habit","title":"Intellectual Humility Habit","links":[],"tags":[],"content":"Mental Habit: Intellectual Humility in Engineering Education\n1. Description and Theoretical Framework\nDefinition and Importance\nIntellectual humility is a mental habit characterized by the recognition of one’s intellectual limitations and an openness to alternative perspectives. As defined by researchers, intellectual humility is “the virtue of accurately tracking the intellectual or evidential quality of your beliefs” iConnectEngineers. For engineers, intellectual humility creates a willingness to admit what one doesn’t know, acknowledge mistakes, and recognize that one’s understanding may be incomplete or incorrect.\nThis habit is particularly crucial in engineering contexts where complex problems rarely have single, obvious solutions and where collaboration across disciplines is increasingly necessary. According to engineering researchers, intellectual humility is essential for “interdisciplinary competence” and is considered one of the “intellectual virtues needed for success in interdisciplinary research” Frontiers.\nTheoretical Framework: Habit Formation Through Context and Practice\nAccording to habit formation theory, intellectual humility, like other habits, develops through consistent practice in supportive contexts. Drawing from Wood’s Context-Trigger-Reward model, intellectual humility can be cultivated through:\n\nContext: Learning environments where uncertainty and limitations in knowledge are normalized rather than penalized\nTrigger: Regular exposure to situations that reveal knowledge gaps or conflicting perspectives\nReward: Recognition and positive outcomes that result from acknowledging limitations and integrating diverse viewpoints\n\nFor intellectual humility to become habitual, engineers need consistent practice in recognizing their knowledge limitations and responding constructively to intellectual challenges. This approach isn’t about diminishing confidence but rather developing a more accurate assessment of one’s knowledge and expertise. As researchers note, intellectual humility “is not necessarily incompatible with serious intellectual conviction” iConnectEngineers - engineers can have strong convictions while remaining open to evidence that might require revising those beliefs.\n2. Engineering Education Applications\nDetailed Implementation: The “Bridge Load Prediction Challenge”\nOverview\nThe Bridge Load Prediction Challenge is a structured laboratory activity designed specifically for freshman civil engineering students to develop intellectual humility through iterative bridge design, load prediction, and failure analysis. This activity creates a learning environment where students must regularly confront the limitations of their engineering knowledge, make increasingly calibrated predictions, and acknowledge gaps in their understanding.\nTechnical Setup and Materials\nEquipment Required:\n\nMaterials testing equipment:\n\nDigital force gauge with data acquisition system (measuring range 0-500N)\nDeflection measurement instruments (dial indicators with 0.01mm precision)\nHigh-speed camera for failure mode documentation (120fps minimum)\n\n\nBridge construction materials:\n\nBasswood sticks (1/8” × 1/8” × 24”)\nCarpenter’s glue\nExacto knives and cutting mats\nGram scales for weighing completed bridges\n\n\nComputational resources:\n\nStructural analysis software (simplified version of SAP2000)\nDigital design journals (tablets or laptops)\n\n\nDocumentation templates:\n\nLoad prediction worksheets with certainty scales\nFailure analysis forms\nTeam reflection documents\n\n\n\nPre-lab Preparation:\n\n\nCreate standardized bridge design requirements:\n\nSpan length: 300mm\nMaximum height: 100mm\nMaximum width: 75mm\nMaximum weight: 50g\nLoading point: Center span, applied vertically\nSupport conditions: Simple supports (pin and roller)\n\n\n\nPrepare instructional materials on:\n\nBasic truss analysis principles\nMaterial properties of basswood (with intentionally limited information)\nJoint design considerations\nSimplified beam theory equations\n\n\n\nImplementation Process\nPhase 1: Initial Design and Prediction (2 weeks)\n\n\nStudent teams (3-4 students) design and construct their first bridge prototype\n\n\nBefore testing, each team must:\n\nSubmit detailed structural analysis calculations\nPredict the ultimate load their bridge will carry\nSpecify failure mode (joint failure, compression buckling, tension failure)\nProvide confidence intervals (minimum and maximum expected load)\nRate their confidence in predictions (0-100%)\nDocument their reasoning and assumptions\n\n\n\nCritical element: Students must individually provide predictions before discussing as a team, then reach consensus on team predictions\n\n\nPhase 2: First Testing and Calibration (1 lab session)\n\n\nBridges are tested to failure in front of the entire class, with real-time load-deflection data displayed\n\n\nActual results are compared to predictions, with emphasis on:\n\nPercentage error in load prediction\nAccuracy of predicted failure mode\nWidth of confidence intervals versus actual results\nRelationship between confidence levels and accuracy\n\n\n\nEach team receives their “prediction calibration score” (ratio of actual prediction accuracy to stated confidence)\n\n\nInstructor facilitates whole-class discussion on sources of error:\n\nMaterial property assumptions\nJoint efficiency estimates\nAnalysis simplifications\nConstruction quality factors\n\n\n\nPhase 3: Redesign with Knowledge Calibration (3 weeks)\n\n\nTeams redesign their bridges with new requirements:\n\nChanged loading position (off-center)\nDifferent support conditions (fixed-pin)\nMaterial limitations (maximum cross-sectional area at specific locations)\n\n\n\nDuring the redesign process, teams must:\n\nDocument what they learned from the first bridge failure\nIdentify specific knowledge gaps revealed in first test\nConsult with other teams on specific technical questions\nSeek faculty guidance on identified knowledge limitations\nUpdate their analysis methods based on observed discrepancies\n\n\n\nTeams submit new predictions with:\n\nMore detailed uncertainty analyses\nExplicit documentation of assumptions\nMultiple failure mode scenarios\nRevised confidence intervals\nJustification for changes in confidence levels\n\n\n\nPhase 4: Final Testing and Reflection (1 week)\n\n\nSecond-generation bridges are tested to failure\n\n\nTeams analyze their prediction improvement:\n\nChange in prediction accuracy\nRefinement in confidence interval width\nAppropriateness of revised confidence levels\nAccuracy of multiple failure mode predictions\n\n\n\nFinal reflection assignment includes:\n\nAnalysis of knowledge gaps identified during the process\nComparison of first and second prediction calibration scores\nDocumentation of intellectual humility moments during the project\nReflection on team dynamics around uncertainty discussions\nIdentification of remaining questions for future learning\n\n\n\nEngineering Learning Outcomes\nThis activity develops several essential civil engineering competencies:\n\nStructural analysis fundamentals: Students apply basic principles of statics and mechanics of materials\nPrediction under uncertainty: Students learn to make and qualify predictions when information is incomplete\nFailure analysis: Students develop skills in identifying and analyzing structural failure modes\nIterative design: Students experience the design-test-redesign cycle with quantitative feedback\n\nMost importantly, the bridge challenge cultivates intellectual humility as a professional habit by:\n\nCreating a concrete, quantifiable measure of the gap between perceived and actual knowledge\nNormalizing knowledge limitations as part of the engineering design process\nDemonstrating how improved predictions come from acknowledging previous errors\nEstablishing a learning community where asking questions is valued over appearing knowledgeable\n\nThe activity has been implemented in first-year civil engineering programs at multiple universities, with assessment data showing significant improvements in students’ ability to accurately calibrate confidence to knowledge, increased comfort in expressing uncertainty, and greater willingness to consult peers and faculty when faced with knowledge limitations.\n3. Assessment and Measurement\nIndicators of Intellectual Humility as a Mental Habit\nObservable behaviors that indicate intellectual humility has become habitual in engineering students include:\n\nAccurately qualifying statements based on evidence strength\nSpontaneously acknowledging uncertainty and knowledge limitations\nSeeking diverse perspectives when facing complex problems\nRevising positions in response to new evidence\nAsking genuine questions rather than making defensive assertions\nAcknowledging and learning from mistakes\nAppropriately citing and building on others’ contributions\n\nAssessment Methods\n1. Knowledge Calibration Metrics Research shows that intellectual humility correlates with “more accurate assessment of one’s knowledge” Tandfonline. Engineering educators can use calibration exercises where students estimate their confidence in answers and compare with actual accuracy.\n2. Behavioral Observation Protocols Faculty can use structured observation protocols to track behaviors associated with intellectual humility during team projects, design reviews, and laboratory activities.\n3. Self-Report Measures Validated intellectual humility scales such as the “Comprehensive Intellectual Humility Scale” can be administered at intervals to track development over time.\n4. Reflective Writing Analysis Content analysis of students’ reflective journals can identify instances of intellectual humility, including acknowledgment of mistakes, recognition of knowledge limitations, and openness to alternative perspectives.\n5. Peer and Self-Assessment Engineering teams can evaluate both individual and collective intellectual humility as part of regular team functioning assessments, reinforcing its importance in collaborative engineering work.\n4. Challenges and Considerations\nPotential Barriers\n1. Confusion with Lack of Confidence Students and faculty may mistake intellectual humility for lack of confidence or certainty. In reality, intellectual humility involves “accurately tracking” one’s knowledge iConnectEngineers, not understating it.\n2. Professional Culture of Expertise Engineering culture often rewards projecting confidence and expertise, potentially conflicting with the open acknowledgment of limitations that intellectual humility requires.\n3. Assessment Systems Traditional engineering assessment methods may unintentionally penalize expressions of uncertainty, even when appropriate, by rewarding definitive answers over nuanced ones.\n4. Reward Structures Academic environments may inadvertently reward intellectual arrogance through recognition systems that emphasize individual achievement over collaborative learning.\nMitigation Strategies\n1. Distinguish Humility from Uncertainty Explicitly teach the difference between intellectual humility and general uncertainty, emphasizing that intellectual humility involves accurate, not reduced, assessment of knowledge.\n2. Model Professional Application Demonstrate how top engineers and researchers incorporate intellectual humility into their work, showing how acknowledging limitations actually enhances rather than diminishes professional credibility.\n3. Implement Appropriate Assessment Develop assessment methods that evaluate not just technical correctness but also appropriate qualification of assertions based on evidence strength.\n4. Create Safe Learning Environments Establish classroom norms where acknowledging knowledge limitations is valued, ensuring students feel safe expressing intellectual humility without fear of academic penalties.\n5. References\nAlfano, M., Iurino, K., Stey, P., Robinson, B., Christen, M., Yu, F., &amp; Lapsley, D. (2017). Development and validation of a multi-dimensional measure of intellectual humility. PLoS One, 12(4), e0182950.\nBaehr, J. (Ed.). (2015). Intellectual virtues and education: Essays in applied virtue epistemology. Routledge.\nChurch, I. M., &amp; Barrett, J. L. (2016). Intellectual humility. In E. L. Worthington Jr., D. E. Davis, &amp; J. N. Hook (Eds.), Handbook of humility: Theory, research, and applications (pp. 62-75). Routledge.\nDeffler, S. A., Leary, M. R., &amp; Hoyle, R. H. (2016). Knowing what you know: Intellectual humility and judgments of recognition memory. Personality and Individual Differences, 96, 255-259.\niConnectEngineers. (n.d.). How “Intellectual Humility” Can Make You a Better Engineer. Retrieved from iconnectengineers.com/blog/intellectual-humility-can-make-better-engineer/\nKrumrei-Mancuso, E. J., Haggard, M. C., LaBouff, J. P., &amp; Rowatt, W. C. (2019). Links between intellectual humility and acquiring knowledge. The Journal of Positive Psychology, 15(2), 155-170.\nLattuca, L. R., Knight, D. B., Ro, H. K., &amp; Novoselich, B. J. (2017). Supporting the development of engineers’ interdisciplinary competence. Journal of Engineering Education, 106(1), 71-97.\nLeary, M. R., Diebels, K. J., Davisson, E. K., Jongman-Sereno, K. P., Isherwood, J. C., Raimi, K. T., &amp; Hoyle, R. H. (2017). Cognitive and interpersonal features of intellectual humility. Personality and Social Psychology Bulletin, 43(6), 793-813.\nPorter, T., Elnakouri, A., Meyers, E. A., Shibayama, T., Jayawickreme, E., &amp; Grossmann, I. (2022). Predictors and consequences of intellectual humility. Nature Reviews Psychology, 1, 524-536.\nSivakumar, K., &amp; Boon, M. (2024). The role of intellectual humility in promoting epistemic fluency for interdisciplinary engineering education. Frontiers in Education, 9, 1395265.\nVanney, C. E., &amp; Sáenz, M. P. (2022). Interdisciplinary research and intellectual virtues. In Interdisciplinary Knowledge Exchange in Southern Europe (pp. 15-30). Springer, Cham."},"Metacognition-Habit":{"slug":"Metacognition-Habit","title":"Metacognition Habit","links":[],"tags":[],"content":"Mental Habit: Metacognitive Thinking in Engineering Education\n\n1. Description and Theoretical Framework\nDefinition and Importance\nMetacognitive thinking—often referred to as reflection—is the mental habit of being aware of, monitoring, and intentionally improving one’s own thinking and learning processes. It is the inner dialogue that accompanies high-performance engineering work: “Why am I approaching it this way? What assumptions am I making? What am I learning?” It allows engineers to move from reactive behavior to deliberate, adaptive, and growth-oriented practice.\nMetacognition is what enables engineers to learn from failure, improve over time, and develop wisdom. It is especially important in complex, ill-defined problems where there are no clear answers. According to John Flavell, who first popularized the term, metacognition includes both knowledge about cognition (awareness of strategies, limits, and preferences) and regulation of cognition (planning, monitoring, and evaluating one’s own thinking).\nDeveloping this habit transforms students from passive recipients of instruction into active agents in their own intellectual development. It promotes lifelong learning, better decision-making, and ultimately, ethical and thoughtful engineering practice.\n\n2. Theoretical Framework: Dimensions of Metacognitive Thinking\n1. Self-Awareness Dimension: Recognizing one’s own cognitive patterns, habits, and blind spots\n\n\nIdentifying strengths, weaknesses, and cognitive biases\n\n\nNaming emotions and reactions during learning or problem solving\n\n\nUnderstanding how one’s values and experiences shape interpretation\n\n\n2. Monitoring and Regulation Dimension: Continuously assessing and adjusting one’s approach\n\n\nAsking “Is this working? Should I try another strategy?”\n\n\nEvaluating progress against goals or rubrics\n\n\nMaking mid-course corrections\n\n\n3. Reflective Integration Dimension: Making sense of experiences to inform future behavior\n\n\nExtracting insight from mistakes, successes, and feedback\n\n\nConnecting past experiences to present challenges\n\n\nTurning tacit knowledge into explicit learning\n\n\n4. Habitual Reflection Dimension: Developing a routine of ongoing self-assessment\n\n\nBuilding time into projects for intentional reflection\n\n\nKeeping journals, logs, or voice memos to track learning\n\n\nEngaging in reflective dialogue with peers or mentors\n\n\n\n3. Engineering Education Applications\nCase Example: “Thinking About Thinking” Capstone Companion\nOverview: In a senior design capstone, students are assigned a metacognitive companion assignment alongside their technical project. Each week, they reflect on their team’s decision-making, personal contributions, mindset, and learning.\nImplementation Phases:\n\n\nOnboarding to Metacognition (Week 1–2)\n\n\nFaculty introduces metacognition with examples from engineering practice\n\n\nStudents complete a baseline reflection identifying their default learning and thinking styles\n\n\n\n\nWeekly Reflective Prompts (Weeks 3–14)\n\n\nPrompts include questions like:\n\n\nWhat surprised you this week?\n\n\nWhat assumptions did you make that turned out to be wrong?\n\n\nWhat changed in your thinking?\n\n\nWhat would you do differently if starting again?\n\n\n\n\n\n\nPeer Metacognition\n\n\nStudents read and comment on teammates’ reflections weekly\n\n\nStructured peer dialogue sessions emphasize shared learning\n\n\n\n\nFinal Reflection Portfolio\n\n\nStudents synthesize lessons from their metacognitive entries\n\n\nFinal submission includes a personal learning statement: “This is how I’ve changed as a thinker.”\n\n\n\n\n\n4. Indicators of Metacognitive Thinking as a Mental Habit\nObservable Behaviors:\n\n\nArticulating not just what they did, but why they chose it and how they might improve it\n\n\nIdentifying specific learning moments or mindset shifts\n\n\nDiscussing strategies they tried—and whether they worked\n\n\nDescribing emotional or cognitive reactions to challenges\n\n\nMaking connections across projects, courses, or experiences\n\n\nAsking meta-level questions during group work or problem solving\n\n\nAssessment Tools:\n\n\nReflection Rubrics: Evaluate depth, specificity, and forward-looking nature of student reflections\n\n\nLearning Journals: Ongoing entries can be assessed for evolution of thinking over time\n\n\nSelf-Evaluation Grids: Students rate and justify their own learning behaviors, tracked over milestones\n\n\nPeer Feedback on Growth: Teammates assess each other’s self-awareness and adaptation\n\n\n\n5. Challenges and Mitigation Strategies\nChallenges\n\n\nStudents may view reflection as “fluff” or busywork, especially in technical fields\n\n\nShallow reflections are common without modeling and scaffolding\n\n\nFaculty may feel underprepared to assess metacognition fairly and constructively\n\n\nStrategies\n\n\nShare compelling examples of how metacognitive habits led to innovation, resilience, or success\n\n\nProvide rubrics and annotated reflection examples to clarify expectations\n\n\nInclude reflection as a graded component with meaningful weight\n\n\nFoster a culture of curiosity and psychological safety in classrooms and teams\n\n\n\n6. Conclusion\nMetacognitive thinking is foundational for engineers who aim to grow not just in skill, but in wisdom. It provides the compass for continuous improvement, ethical integrity, and adaptive expertise. Helping students build the Reflection Habit equips them not just to do engineering—but to become reflective, thoughtful engineers who know themselves, learn continuously, and adapt with intention.\n\nKey question for reflection: What’s the most important thing you’ve learned about how you learn?\n"},"Opportunity-Habit":{"slug":"Opportunity-Habit","title":"Opportunity Habit","links":[],"tags":[],"content":"Mental Habit: Opportunity-Oriented Thinking in Engineering Education\n\n1. Description and Theoretical Framework\nDefinition and Importance\nOpportunity-oriented thinking is a mental habit rooted in the proactive pursuit of potential. It involves scanning for unmet needs, envisioning new possibilities, and responding with optimism and courage to ambiguity, change, and challenge. Engineers with this habit develop a bias toward action and a growth mindset. They are not content to react to problems—they are compelled to find opportunities in those problems, or even better, before they arise.\nThis mental habit unites curiosity, optimism, and tenacity. It also involves pattern recognition and a sensitivity to gaps—places where systems underperform, markets fail to serve, or solutions fall short. According to Carol Dweck’s work on growth mindset, individuals who view challenges as opportunities to learn are more likely to persist and innovate. Similarly, Sarasvathy’s effectuation theory sees opportunity as something co-created by the agent and the environment, not just discovered. This means engineers can shape opportunity spaces, not just find them.\n\n2. Theoretical Framework: Dimensions of Opportunity-Oriented Thinking\n1. Challenge Embrace Dimension: The tendency to seek out and take on difficult or undefined problems.\n\n\nSeeing ambiguity as opportunity rather than threat\n\n\nTaking initiative to start projects without guarantees of success\n\n\nLeaning into discomfort and uncertainty\n\n\n2. Gap Sensitivity Dimension: The ability to recognize areas of unmet need, dysfunction, or underperformance.\n\n\nObserving pain points, inefficiencies, or recurring complaints\n\n\nAsking questions like “What’s missing here?” or “Why hasn’t this been solved yet?”\n\n\nSynthesizing user stories, data, and system observations to reveal white space\n\n\n3. Growth Orientation Dimension: The mindset that ability and impact grow through effort, iteration, and learning.\n\n\nResponding to setbacks with persistence and adaptation\n\n\nValuing experimentation over perfection\n\n\nReframing failure as insight\n\n\n4. Proactive Vision Dimension: The skill of envisioning what could be rather than accepting what is.\n\n\nImagining future states and reverse-engineering from a vision\n\n\nUsing foresight tools or speculative design methods\n\n\nThinking expansively before converging narrowly\n\n\n\n3. Engineering Education Applications\nCase Example: “What’s Missing?” Innovation Sprint\nOverview: A three-week design sprint challenges junior engineering students to identify and explore opportunity spaces in areas they care about—campus life, sustainability, healthcare, accessibility, or mobility. The emphasis is on identifying gaps and articulating opportunities, not building final solutions.\nImplementation Phases:\n\n\nOpportunity Sensing (Week 1)\n\n\nStudents conduct a “frustration diary” or “delight and disappointment walk” to notice opportunity areas\n\n\nTeams collect observations, interview users, and analyze small system breakdowns or points of inefficiency\n\n\n\n\nGap Framing &amp; Storytelling (Week 2)\n\n\nTeams identify 2–3 opportunity spaces and create a one-minute story for each, using visuals and quotes\n\n\nThey frame the opportunity with a challenge statement and “why now” rationale\n\n\n\n\nOpportunity Pitching (Week 3)\n\n\nStudents use the Opportunity Canvas to evaluate desirability, feasibility, and potential impact\n\n\nFinal deliverables include a structured pitch of one opportunity space and early concept directions\n\n\n\n\n\n4. Indicators of Opportunity-Oriented Thinking as a Mental Habit\nObservable Behaviors:\n\n\nInitiating projects or proposing improvements without being asked\n\n\nResponding to vague or poorly defined problems with creative framing\n\n\nIdentifying gaps between user needs and existing solutions\n\n\nGenerating multiple opportunity statements from a single observation\n\n\nReframing constraints as creative enablers\n\n\nExpressing excitement rather than fear when encountering ambiguity\n\n\nAssessment Tools:\n\n\nOpportunity Journal Review: Assess students’ logs for quantity, diversity, and depth of identified opportunities\n\n\nGrowth Reflection Essays: Analyze student responses to challenge and failure for signs of mindset development\n\n\nChallenge Reframing Exercises: Give students ambiguous scenarios and evaluate how well they identify meaningful opportunities\n\n\nForesight Storyboards: Ask students to imagine a better future state and how it might be engineered\n\n\n\n5. Challenges and Mitigation Strategies\nChallenges\n\n\nStudents often equate opportunities with fully formed ideas, skipping the gap-finding stage\n\n\nFear of failure or wrong answers can suppress exploratory behavior\n\n\nCurriculum structures that reward correct answers more than divergent thinking\n\n\nStrategies\n\n\nNormalize partial ideas and celebrate early-stage exploration\n\n\nProvide low-risk environments for speculation and risk-taking\n\n\nHighlight case studies where small insights led to big opportunity spaces\n\n\nTrain faculty to ask questions that open rather than close thinking\n\n\n\n6. Conclusion\nOpportunity-oriented thinking prepares students not just to solve existing problems, but to become agents of change—actively shaping the future through engineering. When this habit is internalized, students become relentless seekers of improvement, energized by the question: “What could be better—and how might I begin?”\n\nKey question for reflection: When you encounter frustration, do you lean in with curiosity or retreat with resignation?\n"},"Welcome":{"slug":"Welcome","title":"Welcome","links":["create-a-link"],"tags":[],"content":"This is your new vault.\nMake a note of something, create a link, or try the Importer!\nWhen you’re ready, delete this note and make the vault your own."},"index":{"slug":"index","title":"Welcome to Quartz 4","links":["EM-Stuff","showcase","authoring-content","configuration","layout","build","setting-up-your-GitHub-repository","hosting","Obsidian-compatibility","full-text-search","graph-view","wikilinks","backlinks","features/Latex","syntax-highlighting","popover-previews","Docker-Support","i18n","comments","features","creating-components","SPA-Routing","making-plugins","philosophy","architecture","upgrading"],"tags":[],"content":"EM Stuff\nQuartz is a fast, batteries-included static-site generator that transforms Markdown content into fully functional websites. Thousands of students, developers, and teachers are already using Quartz to publish personal notes, websites, and digital gardens to the web.\n🪴 Working on it!\nQuartz requires at least Node v20 and npm v9.3.1 to function correctly. Ensure you have this installed on your machine before continuing.\nThen, in your terminal of choice, enter the following commands line by line:\ngit clone github.com/jackyzha0/quartz.git\ncd quartz\nnpm i\nnpx quartz create\nThis will guide you through initializing your Quartz with content. Once you’ve done so, see how to:\n\nWriting content in Quartz\nConfigure Quartz’s behaviour\nChange Quartz’s layout\nBuild and preview Quartz\nSync your changes with GitHub\nHost Quartz online\n\nIf you prefer instructions in a video format you can try following Nicole van der Hoeven’s\nvideo guide on how to set up Quartz!\n🔧 Features\n\nObsidian compatibility, full-text search, graph view, note transclusion, wikilinks, backlinks, Latex, syntax highlighting, popover previews, Docker Support, internationalization, comments and many more right out of the box\nHot-reload for both configuration and content\nSimple JSX layouts and page components\nRidiculously fast page loads and tiny bundle sizes\nFully-customizable parsing, filtering, and page generation through plugins\n\nFor a comprehensive list of features, visit the features page. You can read more about the why behind these features on the philosophy page and a technical overview on the architecture page.\n🚧 Troubleshooting + Updating\nHaving trouble with Quartz? Try searching for your issue using the search feature. If you haven’t already, upgrade to the newest version of Quartz to see if this fixes your issue.\nIf you’re still having trouble, feel free to submit an issue if you feel you found a bug or ask for help in our Discord Community."}}